In [9]:
import pandas as pd
data = {
    'Name': ['Amit', 'Riya', 'Ram'],
    'Age': [23, 21, 25],
    'City': ['Delhi', 'Mumbai', 'Chennai'],
    'Marks': [78, 85, 67]
}

df = pd.DataFrame(data)
print(df)
df = pd.read_csv("pandas.csv")
df.head()
df.tail()
df.info()
df.describe()
df["Name"]
df[['Name','Age']]
df.loc[0]
df.iloc[0]
df[df['Age'] > 22 ]
df['Age_plus_5'] = df['Age'] + 5
df.drop('Age_plus_5', axis=1, inplace=True)
df.drop(0, axis=0, inplace=True)
df.sort_values(by='Age', ascending=False) 
df.groupby('Name')['Age'].mean()
df.dropna()

   Name  Age     City  Marks
0  Amit   23    Delhi     78
1  Riya   21   Mumbai     85
2   Ram   25  Chennai     67
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    5 non-null      object
 1   Age     5 non-null      int64
 2   City    5 non-null      object
 3   Marks   5 non-null      int64
dtypes: int64(2), object(2)
memory usage: 292.0+ bytes

    Name  Age       City  Marks
1   Riya   21     Mumbai     85
2    Ram   25    Chennai     67
3   Sana   22  Bangalore     90
4  Kiran   24       Pune     72